'use strict'

/*
|--------------------------------------------------------------------------
| ProtectionDetailSeeder
|--------------------------------------------------------------------------
|
| Make use of the Factory instance to seed database with dummy data or
| make use of Lucid models directly.
|
*/

/** @type {import('@adonisjs/lucid/src/Factory')} */
const ProtectionDetail = use('App/Models/ProtectionDetail')

class ProtectionDetailSeeder {
  async run () {
    var protectionDetail
    // protectionDetail.detail = JSON.stringify({
    //   "...": "...",
    //   "...": "...",
    // })

  //ซ่อมห้าง
    protectionDetail = new ProtectionDetail()
    protectionDetail.details = JSON.stringify({
      "protections": [
        {
         "header": "ความรับผิดต่อกลุ่มบุคคลภายนอก",
         "details": [
           {
             "detail": "ความเสียหายต่อชีวิต ร่างกายหรืออนามัยเฉพาะส่วนที่เกิน (วงเงินสูงสุดตาม พรบ. = 10,000,000 บาท / ครั้ง)",
             "protection": "500,000 บาท / คน"
           },
           {
             "detail": "ความเสียหายต่อทรัพย์สิน",
             "protection": "1,000,000 บาท / ครั้ง"
           },
         ]
        },
        {
         "header": "รถยนต์เสียหาย สูญหาย ไฟไหม้",
         "details": [
           {
             "detail": "ความเสียหายต่อรถยนต์",
             "protection": "ไม่เกินทุนประกัน"
           },
           {
             "detail": "รถยนต์สูญหาย/ไฟไหม้",
             "protection": "ไม่เกินทุนประกัน"
           },
         ]
        },
        {
         "header": "ความคุ้มครองตามเอกสารแนบท้าย",
         "details": [
           {
             "detail": "อุบัติเหตุส่วนบุคคล (เสียชีวิต สูญเสียอวัยวะ ทุพพลภาพถาวร)",
             "protection": "ผู้ขับขี่และผู้โดยสารในรถประกัน 100,000 บาท / คน"
           },
           {
             "detail": "ค่ารักษาพยาบาล",
             "protection": "100,000 บาท / คน"
           },
           {
             "detail": "การประกันตัวผู้ขับขี่",
             "protection": "300,000 บาท / ครั้ง"
           },
           {
             "detail" : "จำนวนที่นั่ง",
             "protection" : "รถเก๋ง 7 / รถปิคอัพ 4 / รถตู้4"
           }
         ]
        }
      ],
      "annotation" : [
        {
          "header" : "เงื่อนไขการรับประกันภัย",
          "detail" : "(1) สำหรับรถญี่ปุ่นและอื่นๆ (รถกลุ่ม 3-5) เช่น Honda Accord, Toyota Altis, Nissan March, Toyota Commuter เป็นต้น (2) สำหรับรถยุโรป (กลุ่ม 1-2) เช่น Mercedes Benz, BMW, VOLVO, AUDI เป็นต้น (3) รถยนต์นั่งใช้ส่วนบุคคล (รหัส 110), รถกระบะปิคอัพไม่เกิน 3 ตัน (รหัส 320), รถตู้โดยสารส่วนบุคคล (รหัส 210) (4) เบี้ยประกันภัยข้างต้นยังไม่รวมเบี้ยประกันภัย พรบ. (ภาคบังคับ) : เก๋ง = 645.21 บาท, กระบะปิคอัพ = 967.28 บาท, ตู้โดยสารส่วนบุคคล = 1,182.35 บาท (5) ไม่จำกัดอายุรถยนต์กรณีซ่อมอู่ทั่วไป (ขอสงวนสิทธิ์เฉพาะรถยนต์ที่บริษัทกำหนด) และไม่เกิน 5 ปี กรณีซ่อมห้าง / ไม่ต้องตรวจสภาพรถก่อนทำประกันภัย (6) มูลค่ารถขณะที่เอาประกันภัย ต้องไม่ต่ำกว่าจำนวนเงินเอาประกันภัยตามแผนประกันภัยที่เลือก และคุ้มครองอุปกรณ์เครื่องตกแต่ง ตามมาตรฐานของโรงงานเท่านั้น (7) เบี้ยประกันภัยข้างต้นได้คำนวณรวมส่วนลดกล้องโทรทัศน์วงจรปิด (CCTV) ไว้แล้ว และมีผลบังคับจนกว่าจะมีการแจ้งเปลี่ยนแปลง"
        },
        {
          "header" : "รถยนต์ที่บริษัทฯ สงวนสิทธิ์ ไม่รับประกันภัย",
          "detail" : "(1) รถยนต์รับจ้างหรือให้เช่า,รถยนต์ที่ใช้เพื่อการพาณิชย์ มูลนิธิ รถร่วม รถกู้ชีพ รถอาสากู้ภัย รถติดไซเรน ฯลฯ (2) ไม่รับประกันรถบรรทุกเชื้อเพลิง กรด แก๊ส หรือรถบรรทุกวัตถุอันตราย, รถยนต์ที่มีการตกแต่งเพิ่มเติม หรือดัดแปลงสภาพจากเดิม เช่น รถโหลดเตี้ยหรือยกสูง, รถปรับแต่งเครื่องยนต์ (3) ติดเคฟลาร์ (Cafla), สติ๊กเกอร์ตกแต่งทุกชนิด และหรือ รถกระบะที่มีการติดตั้งอุปกรณ์เสริมพิเศษต่างๆ เช่น ติดตั้งตู้เหล็กพร้อมเครื่องทำความเย็น, เครน, ตะแกรงเหล็ก, เฮี๊ยบ, โครงเหล็กหรือหลังคา หรืออุปกรณ์ใดๆ เช่น ติดตั้งตู้เหล็กพร้อมเครื่องทำความเย็น, เครน, ตะแกรงเหล็ก, เฮี๊ยบ, โครงเหล็กหรือหลังคา หรืออุปกรณ์ใดๆ"
        }
      ]
    })
    await protectionDetail.save()

//ซ่อมอู่
protectionDetail = new ProtectionDetail()
    protectionDetail.details = JSON.stringify({
      "protections": [
        {
         "header": "ความรับผิดต่อกลุ่มบุคคลภายนอก",
         "details": [
           {
             "detail": "ความเสียหายต่อชีวิต ร่างกายหรืออนามัยเฉพาะส่วนที่เกิน (วงเงินสูงสุดตาม พรบ. = 10,000,000 บาท / ครั้ง)",
             "protection": "500,000 บาท / คน"
           },
           {
             "detail": "ความเสียหายต่อทรัพย์สิน",
             "protection": "1,000,000 บาท / ครั้ง"
           },
         ]
        },
        {
         "header": "รถยนต์เสียหาย สูญหาย ไฟไหม้",
         "details": [
           {
             "detail": "ความเสียหายต่อรถยนต์",
             "protection": "ไม่เกินทุนประกัน"
           },
           {
             "detail": "รถยนต์สูญหาย/ไฟไหม้",
             "protection": "ไม่เกินทุนประกัน"
           },
         ]
        },
        {
         "header": "ความคุ้มครองตามเอกสารแนบท้าย",
         "details": [
           {
             "detail": "อุบัติเหตุส่วนบุคคล (เสียชีวิต สูญเสียอวัยวะ ทุพพลภาพถาวร)",
             "protection": "ผู้ขับขี่และผู้โดยสารในรถประกัน 100,000 บาท / คน"
           },
           {
             "detail": "ค่ารักษาพยาบาล",
             "protection": "100,000 บาท / คน"
           },
           {
             "detail": "การประกันตัวผู้ขับขี่",
             "protection": "300,000 บาท / ครั้ง"
           },
           {
             "detail" : "จำนวนที่นั่ง",
             "protection" : "รถเก๋ง 7 / รถปิคอัพ 4 / รถตู้4"
           }
         ]
        }
      ],
      "annotation" : [
        {
          "header" : "เงื่อนไขการรับประกันภัย",
          "detail" : "(1) สำหรับรถญี่ปุ่นและอื่นๆ (รถกลุ่ม 3-5) เช่น Honda Accord, Toyota Altis, Nissan March, Toyota Commuter เป็นต้น (2) สำหรับรถยุโรป (กลุ่ม 1-2) เช่น Mercedes Benz, BMW, VOLVO, AUDI เป็นต้น (3) รถยนต์นั่งใช้ส่วนบุคคล (รหัส 110), รถกระบะปิคอัพไม่เกิน 3 ตัน (รหัส 320), รถตู้โดยสารส่วนบุคคล (รหัส 210) (4) เบี้ยประกันภัยข้างต้นยังไม่รวมเบี้ยประกันภัย พรบ. (ภาคบังคับ) : เก๋ง = 645.21 บาท, กระบะปิคอัพ = 967.28 บาท, ตู้โดยสารส่วนบุคคล = 1,182.35 บาท (5) ไม่จำกัดอายุรถยนต์กรณีซ่อมอู่ทั่วไป (ขอสงวนสิทธิ์เฉพาะรถยนต์ที่บริษัทกำหนด) และไม่เกิน 5 ปี กรณีซ่อมห้าง / ไม่ต้องตรวจสภาพรถก่อนทำประกันภัย (6) มูลค่ารถขณะที่เอาประกันภัย ต้องไม่ต่ำกว่าจำนวนเงินเอาประกันภัยตามแผนประกันภัยที่เลือก และคุ้มครองอุปกรณ์เครื่องตกแต่ง ตามมาตรฐานของโรงงานเท่านั้น (7) เบี้ยประกันภัยข้างต้นได้คำนวณรวมส่วนลดกล้องโทรทัศน์วงจรปิด (CCTV) ไว้แล้ว และมีผลบังคับจนกว่าจะมีการแจ้งเปลี่ยนแปลง"
        },
        {
          "header" : "รถยนต์ที่บริษัทฯ สงวนสิทธิ์ ไม่รับประกันภัย",
          "detail" : "(1) รถยนต์รับจ้างหรือให้เช่า,รถยนต์ที่ใช้เพื่อการพาณิชย์ มูลนิธิ รถร่วม รถกู้ชีพ รถอาสากู้ภัย รถติดไซเรน ฯลฯ (2) ไม่รับประกันรถบรรทุกเชื้อเพลิง กรด แก๊ส หรือรถบรรทุกวัตถุอันตราย, รถยนต์ที่มีการตกแต่งเพิ่มเติม หรือดัดแปลงสภาพจากเดิม เช่น รถโหลดเตี้ยหรือยกสูง, รถปรับแต่งเครื่องยนต์ (3) ติดเคฟลาร์ (Cafla), สติ๊กเกอร์ตกแต่งทุกชนิด และหรือ รถกระบะที่มีการติดตั้งอุปกรณ์เสริมพิเศษต่างๆ เช่น ติดตั้งตู้เหล็กพร้อมเครื่องทำความเย็น, เครน, ตะแกรงเหล็ก, เฮี๊ยบ, โครงเหล็กหรือหลังคา หรืออุปกรณ์ใดๆ เช่น ติดตั้งตู้เหล็กพร้อมเครื่องทำความเย็น, เครน, ตะแกรงเหล็ก, เฮี๊ยบ, โครงเหล็กหรือหลังคา หรืออุปกรณ์ใดๆ"
        }
      ]
    })
    await protectionDetail.save()

    // 35 up
    protectionDetail = new ProtectionDetail()
    protectionDetail.details = JSON.stringify({
      "protections": [
        {
        "header": "ความรับผิดต่อกลุ่มบุคคลภายนอก",
        "details": [
          {
            "detail": "ความเสียหายต่อชีวิต ร่างกายหรืออนามัยเฉพาะส่วนที่เกิน (วงเงินสูงสุดตาม พรบ. = 10,000,000 บาท / ครั้ง)",
            "protection": "500,000 บาท / คน"
          },
          {
            "detail": "ความเสียหายต่อทรัพย์สิน",
            "protection": "1,000,000 บาท / ครั้ง"
          },
        ]
        },
        {
        "header": "รถยนต์เสียหาย สูญหาย ไฟไหม้",
        "details": [
          {
            "detail": "ความเสียหายต่อรถยนต์",
            "protection": "ไม่เกินทุนประกัน"
          },
          {
            "detail": "ค่าเสียหายส่วนแรก",
            "protection": "2,000"
          },
          {
            "detail": "รถยนต์สูญหาย/ไฟไหม้",
            "protection": "ไม่เกินทุนประกัน"
          },
        ]
        },
        {
        "header": "ความคุ้มครองตามเอกสารแนบท้าย",
        "details": [
          {
            "detail": "อุบัติเหตุส่วนบุคคล (เสียชีวิต สูญเสียอวัยวะ ทุพพลภาพถาวร)",
            "protection": "ผู้ขับขี่และผู้โดยสารในรถประกัน 100,000 บาท / คน"
          },
          {
            "detail": "ค่ารักษาพยาบาล",
            "protection": "100,000 บาท / คน"
          },
          {
            "detail": "การประกันตัวผู้ขับขี่",
            "protection": "300,000 บาท / ครั้ง"
          },
          {
            "detail" : "จำนวนที่นั่ง",
            "protection" : "รถเก๋ง 7 / รถปิคอัพ 4"
          }
        ]
        }
      ],
      "annotation" : [
        {
          "header" : "หมายเหตุ",
          "detail" : "*ค่าเสียหายส่วนแรก 2,000 บาทกรณีเป็นฝ่ายผิด และผู้ขับขี่มีอายุต่ำกว่า 35 ปี<br/>คุ้มครองกรณีชนกับยานพาหนะทางบกเท่านั้น<br/>(1) สำหรับรถเก๋ง (110) และรถปิคอัพขนาดไม่เกิน 3 ตัน (320) เท่านั้น (2) คุ้มครองความเสียหายต่อรถยนต์ที่เอาประกันภัย เฉพาะกรณีที่เฉี่ยวชนกับยานพาหนะทางบกเท่านั้น (3) มูลค่ารถยนต์ขณะที่เอาประกันภัยต้องไม่ต่ำกว่าจำนวนเงินเอาประกันภัยตามแผนประกันภัยที่เลือก (4) ไม่รับประกันรถที่ติดตั้งโครง-หลังคาเหล็ก โหลดเตี้ยรถแข่ง หรือรถดัดแปลงสภาพทุกชนิด (5) คุ้มครองอุปกรณ์เครื่องตกแต่งตามมาตรฐานของโรงงานเท่านั้น (6) รถกลุ่ม 1, 2 เช่น MERCEDES-BENZ, BMW, VOLVO, AUDI และอื่นๆ (7) 2 พลัส 35 UP ผู้ขับขี่ที่มีอายุต่ำกว่า 35 ปีบริบูรณ์ ณ วันที่เกิดเหตุต้องรับผิดชอบค่าเสียหายส่วนแรก 2,000 บาท ในกรณีที่เป็นฝ่ายผิด ซื้อประกัน"
        }
      ]
    })
    await protectionDetail.save()

    // 2+ Minimal (ซ่อมอู่)
    protectionDetail = new ProtectionDetail()
    protectionDetail.details = JSON.stringify({
      "protections": [
        {
         "header": "ความรับผิดต่อกลุ่มบุคคลภายนอก",
         "details": [
           {
             "detail": "ความเสียหายต่อชีวิต ร่างกายหรืออนามัยเฉพาะส่วนที่เกิน (วงเงินสูงสุดตาม พรบ. = 10,000,000 บาท / ครั้ง)",
             "protection": "500,000 บาท / คน"
           },
           {
             "detail": "ความเสียหายต่อทรัพย์สิน",
             "protection": "1,000,000 บาท / ครั้ง"
           },
         ]
        },
        {
         "header": "รถยนต์เสียหาย สูญหาย ไฟไหม้",
         "details": [
           {
             "detail": "ความเสียหายต่อรถยนต์",
             "protection": "100,000"
           },
           {
             "detail": "รถยนต์สูญหาย/ไฟไหม้",
             "protection": "100,000"
           },
         ]
        },
        {
         "header": "ความคุ้มครองตามเอกสารแนบท้าย",
         "details": [
           {
             "detail": "อุบัติเหตุส่วนบุคคล (เสียชีวิต สูญเสียอวัยวะ ทุพพลภาพถาวร)",
             "protection": "ผู้ขับขี่และผู้โดยสารในรถประกัน 100,000 บาท / คน"
           },
           {
             "detail": "ค่ารักษาพยาบาล",
             "protection": "100,000 บาท / คน"
           },
           {
             "detail": "การประกันตัวผู้ขับขี่",
             "protection": "300,000 บาท / ครั้ง"
           },
           {
             "detail" : "จำนวนที่นั่ง",
             "protection" : "รถเก๋ง 7 / รถปิคอัพ 4"
           }
         ]
        }
      ],
      "annotation" : [
        {
          "header" : "หมายเหตุ",
          "detail" : "คุ้มครองกรณีชนกับยานพาหนะทางบกเท่านั้น<br/>(1) สำหรับรถเก๋ง (110) และรถปิคอัพขนาดไม่เกิน 3 ตัน (320) เท่านั้น (2) คุ้มครองความเสียหายต่อรถยนต์ที่เอาประกันภัย เฉพาะกรณีที่เฉี่ยวชนกับยานพาหนะทางบกเท่านั้น (3) มูลค่ารถยนต์ขณะที่เอาประกันภัยต้องไม่ต่ำกว่าจำนวนเงินเอาประกันภัยตามแผนประกันภัยที่เลือก (4) ไม่รับประกันรถที่ติดตั้งโครง-หลังคาเหล็ก โหลดเตี้ยรถแข่ง หรือรถดัดแปลงสภาพทุกชนิด (5) คุ้มครองอุปกรณ์เครื่องตกแต่งตามมาตรฐานของโรงงานเท่านั้น(6) รถกลุ่ม 1, 2 เช่น MERCEDES-BENZ, BMW, VOLVO, AUDI และอื่นๆ"
        }
      ]
    })
    await protectionDetail.save()

    // 3+
    protectionDetail = new ProtectionDetail()
    protectionDetail.details = JSON.stringify({
      "protections": [
        {
         "header": "ความรับผิดต่อกลุ่มบุคคลภายนอก",
         "details": [
           {
             "detail": "ความเสียหายต่อชีวิต ร่างกายหรืออนามัยเฉพาะส่วนที่เกิน (วงเงินสูงสุดตาม พรบ. = 10,000,000 บาท / ครั้ง)",
             "protection": "500,000 บาท / คน"
           },
           {
             "detail": "ความเสียหายต่อทรัพย์สิน",
             "protection": "1,000,000 บาท / ครั้ง"
           },
         ]
        },
        {
         "header": "รถยนต์เสียหาย สูญหาย ไฟไหม้",
         "details": [
           {
             "detail": "ความเสียหายต่อรถยนต์",
             "protection": "100,000"
           },
           {
            "detail": "ค่าเสียหายส่วนแรก",
            "protection": "ตามแพคเกจที่เลือก*"
          },
         ]
        },
        {
         "header": "ความคุ้มครองตามเอกสารแนบท้าย",
         "details": [
           {
             "detail": "อุบัติเหตุส่วนบุคคล (เสียชีวิต สูญเสียอวัยวะ ทุพพลภาพถาวร)",
             "protection": "ผู้ขับขี่และผู้โดยสารในรถประกัน 100,000 บาท / คน"
           },
           {
             "detail": "ค่ารักษาพยาบาล",
             "protection": "100,000 บาท / คน"
           },
           {
             "detail": "การประกันตัวผู้ขับขี่",
             "protection": "300,000 บาท / ครั้ง"
           },
           {
             "detail" : "จำนวนที่นั่ง",
             "protection" : "รถเก๋ง 7 / รถปิคอัพ 4 / รถตู้4"
           }
         ]
        }
      ],
      "annotation" : [
        {
          "header" : "หมายเหตุ",
          "detail" : "คุ้มครองกรณีชนกับยานพาหนะทางบกเท่านั้น<br/>(1) สำหรับรถเก๋ง (110), รถปิคอัพขนาดไม่เกิน 3 ตัน (320) และรถตู้ส่วนบุคคล (210) เท่านั้น (2) คุ้มครองความเสียหายต่อรถยนต์ที่เอาประกันภัยเฉพาะกรณีที่เฉี่ยวชนกับยานพาหนะทางบกเท่านั้น (3) มูลค่ารถยนต์ขณะที่เอาประกันภัย ต้องไม่ต่ำกว่าจำนวนเงินเอาประกันภัยตามแผนประกันภัยที่เลือก (4) ไม่รับประกันรถที่ติดตั้งโครง-หลังคาเหล็ก โหลดเตี้ยรถแข่ง หรือ รถดัดแปลงสภาพทุกชนิด (5) คุ้มครองอุปกรณ์เครื่องตกแต่งตามมาตรฐานของโรงงานเท่านั้น (6) รถกลุ่ม 1, 2 เช่น MERCEDES-BENZ,BMW, VOLVO, AUDI และอื่นๆ (7)มีค่าเสียหายส่วนแรกกรณีเป็นฝ่ายผิด2,000 บาท"
        }
      ]
    })
    await protectionDetail.save()


    // 2 เซฟ special
    protectionDetail = new ProtectionDetail()
    protectionDetail.details = JSON.stringify({
      "protections": [
        {
         "header": "ความรับผิดต่อกลุ่มบุคคลภายนอก",
         "details": [
           {
             "detail": "ความเสียหายต่อชีวิต ร่างกายหรืออนามัยเฉพาะส่วนที่เกิน (วงเงินสูงสุดตาม พรบ. = 10,000,000 บาท / ครั้ง)",
             "protection": "1,000,000 บาท / คน"
           },
           {
             "detail": "ความเสียหายต่อทรัพย์สิน",
             "protection": "2,000,000 บาท / ครั้ง"
           },
         ]
        },
        {
         "header": "รถยนต์เสียหาย สูญหาย ไฟไหม้",
         "details": [
           {
             "detail": "รถยนต์สูญหาย/ไฟไหม้",
             "protection": "100,000 บาท / ครั้ง"
           },
         ]
        },
        {
         "header": "ความคุ้มครองตามเอกสารแนบท้าย",
         "details": [
           {
             "detail": "อุบัติเหตุส่วนบุคคล (เสียชีวิต สูญเสียอวัยวะ ทุพพลภาพถาวร)",
             "protection": "ผู้ขับขี่และผู้โดยสารในรถประกัน 100,000 บาท / คน"
           },
           {
             "detail": "ค่ารักษาพยาบาล",
             "protection": "100,000 บาท / คน"
           },
           {
             "detail": "การประกันตัวผู้ขับขี่",
             "protection": "300,000 บาท / ครั้ง"
           },
           {
             "detail" : "จำนวนที่นั่ง",
             "protection" : "เก๋ง 5 / ปิคอัพ 5"
           }
         ]
        }
      ],
      "annotation" : [
        {
          "header" : "หมายเหตุ",
          "detail" : "(1) สำหรับรถเก๋ง (110) รถปิคอัพขนาดไม่เกิน 3 ตัน (320)และรถตู้ส่วนบุคคล (210) เท่านั้น (2) มูลค่ารถยนต์ขณะที่เอาประกันภัย ต้องไม่ต่ำกว่าจำนวนเงินเอาประกันภัยตามแผนประกันภัยที่เลือก (3) ไม่รับประกันรถที่ติดตั้งโครง-หลังคาเหล็ก โหลดเตี้ยรถแข่งหรือรถดัดแปลงสภาพทุกชนิด (4) คุ้มครองอุปกรณ์เครื่องตกแต่งตามมาตรฐานของโรงงานเท่านั้น (5) รถกลุ่ม 1, 2 เช่น MERCEDES-BENZ,BMW, VOLVO, AUDI และอื่นๆ"
        },
        {
          "header" : "รถยนต์ที่บริษัทฯ สงวนสิทธิ์ ไม่รับประกันภัย",
          "detail" : "- รถยนต์ที่รับจ้างหรือให้เช่า, รถยนต์ที่ไปใช้ร่วมกับมูลนิธิ เช่น รถมูลนิธิร่วมกตัญญู, รถกู้ชีพ, รถอาสากู้ภัย, รถติดไซเรน ฯลฯ<br/>- รถยนต์บรรทุกเชื้อเพลิง กรด แก๊ส หรือรถบรรทุกวัตถุอันตราย, รถยนต์ที่มีการตกแต่งเพิ่มเติม หรือดัดแปลงจากสภาพเดิม<br/>- จำกัดอายุรถ 1-15 ปี"
        }
      ]
    })
    await protectionDetail.save()

    // 2 กันชน
    protectionDetail = new ProtectionDetail()
    protectionDetail.details = JSON.stringify({
      "protections": [
        {
         "header": "ความรับผิดต่อกลุ่มบุคคลภายนอก",
         "details": [
           {
             "detail": "ความเสียหายต่อชีวิต ร่างกายหรืออนามัยเฉพาะส่วนที่เกิน (วงเงินสูงสุดตาม พรบ. = 10,000,000 บาท / ครั้ง)",
             "protection": "700,000 บาท / คน"
           },
           {
             "detail": "ความเสียหายต่อทรัพย์สิน",
             "protection": "1,000,000 บาท / ครั้ง"
           },
         ]
        },
        {
         "header": "รถยนต์เสียหาย สูญหาย ไฟไหม้",
         "details": [
           {
             "detail": "ความเสียหายต่อรถยนต์",
             "protection": "150,000 บาท / ครั้ง"
           },
           {
            "detail": "รถยนต์สูญหาย/ไฟไหม้",
            "protection": "150,000 บาท / ครั้ง"
          },
         ]
        },
        {
         "header": "ความคุ้มครองตามเอกสารแนบท้าย",
         "details": [
           {
             "detail": "อุบัติเหตุส่วนบุคคล (เสียชีวิต สูญเสียอวัยวะ ทุพพลภาพถาวร)",
             "protection": "ผู้ขับขี่และผู้โดยสารในรถประกัน 100,000 บาท / คน"
           },
           {
             "detail": "ค่ารักษาพยาบาล",
             "protection": "100,000 บาท / คน"
           },
           {
             "detail": "การประกันตัวผู้ขับขี่",
             "protection": "300,000 บาท / ครั้ง"
           },
           {
             "detail" : "จำนวนที่นั่ง",
             "protection" : "เก๋ง 7 / ปิคอัพ 4"
           }
         ]
        }
      ],
      "annotation" : [
        {
          "header" : "หมายเหตุ",
          "detail" : "คุ้มครองกรณีชนกับยานพาหนะทางบกเท่านั้น<br/>*คุ้มครองกรณีเป็นฝ่ายถูกเท่านั้น<br/>(1) สำหรับรถเก๋ง (110) และรถปิคอัพขนาดไม่เกิน 3 ตัน (320) เท่านั้น (2) เบี้ยประกันภัยข้างต้นยังไม่รวมเบี้ยประกันภัย พรบ.(ภาคบังคับ) : เก๋ง = 645.21 บาท , กระบะปิคอัพ = 967.28 บาท (3) มูลค่ารถขณะที่เอาประกันภัยต้องไม่ต่ำกว่าจำนวนเงินเอาประกันภัยตามแผนประกันภัยที่เลือก (4) คุ้มครองความเสียหายต่อรถยนต์ที่เอาประกันภัยเฉพาะกรณีที่เฉี่ยวชนกับยานพหนะทางบกเท่านั้น"
        },
        {
          "header" : "รถยนต์ที่บริษัทฯ สงวนสิทธิ์ ไม่รับประกันภัย",
          "detail" : "- รถยนต์ที่รับจ้างหรือให้เช่า, รถยนต์ที่ไปใช้ร่วมกับมูลนิธิ เช่น รถมูลนิธิร่วมกตัญญู, รถกู้ชีพ, รถอาสากู้ภัย, รถติดไซเรน ฯลฯ<br/>- รถยนต์บรรทุกเชื้อเพลิง กรด แก๊ส หรือรถบรรทุกวัตถุอันตราย, รถยนต์ที่มีการตกแต่งเพิ่มเติม หรือดัดแปลงจากสภาพเดิม"
        }
      ]
    })
    await protectionDetail.save()

    // 3 Best
    protectionDetail = new ProtectionDetail()
    protectionDetail.details = JSON.stringify({
      "protections": [
        {
         "header": "ความรับผิดต่อกลุ่มบุคคลภายนอก",
         "details": [
           {
             "detail": "ความเสียหายต่อชีวิต ร่างกายหรืออนามัยเฉพาะส่วนที่เกิน (วงเงินสูงสุดตาม พรบ. = 10,000,000 บาท / ครั้ง)",
             "protection": "500,000 บาท / คน"
           },
           {
             "detail": "ความเสียหายต่อทรัพย์สิน",
             "protection": "1,000,000 บาท / ครั้ง"
           },
         ]
        },
        {
         "header": "ความคุ้มครองตามเอกสารแนบท้าย",
         "details": [
           {
             "detail": "อุบัติเหตุส่วนบุคคล (เสียชีวิต สูญเสียอวัยวะ ทุพพลภาพถาวร)",
             "protection": "ผู้ขับขี่และผู้โดยสารในรถประกัน 100,000 บาท / คน"
           },
           {
             "detail": "ค่ารักษาพยาบาล",
             "protection": "50,000 บาท / คน"
           },
           {
             "detail": "การประกันตัวผู้ขับขี่",
             "protection": "200,000 บาท / ครั้ง"
           },
           {
             "detail" : "จำนวนที่นั่ง",
             "protection" : "เก๋ง 5 / ปิคอัพ 5 / รถตู้ 7"
           }
         ]
        }
      ],
      "annotation" : [
        {
          "header" : "หมายเหตุ",
          "detail" : "(1) สำหรับรถเก๋ง (110), รถปิคอัพขนาดไม่เกิน 3 ตัน (320) และรถตู้ส่วนบุคคล (210) เท่านั้น (2) ไม่จำกัดอายุรถ (3) เบี้ยประกันภัยข้างต้นยังไม่รวมเบี้ยประกันภัย พรบ.(ภาคบังคับ) เก๋ง = 645.21 บาท, ตู้ = 1,182.35, กระบะปิคอัพ = 967.28 บาท (4) เบี้ยประกันภัยด้านต้นได้คำนวณรวมส่วนลดกล้อง (CCTV) ไว้แล้ว"
        },
      ]
    })
    await protectionDetail.save()

    // 3 กันชน
    protectionDetail = new ProtectionDetail()
    protectionDetail.details = JSON.stringify({
      "protections": [
        {
         "header": "ความรับผิดต่อกลุ่มบุคคลภายนอก",
         "details": [
           {
             "detail": "ความเสียหายต่อชีวิต ร่างกายหรืออนามัยเฉพาะส่วนที่เกิน (วงเงินสูงสุดตาม พรบ. = 10,000,000 บาท / ครั้ง)",
             "protection": "500,000 บาท / คน"
           },
           {
             "detail": "ความเสียหายต่อทรัพย์สิน",
             "protection": "1,000,000 บาท / ครั้ง"
           },
         ]
        },
        {
          "header": "รถยนต์เสียหาย สูญหาย ไฟไหม้",
          "details": [
            {
              "detail": "ความเสียหายต่อรถยนต์",
              "protection": "100,000 บาท / ครั้ง"
            },
          ]
         },
        {
         "header": "ความคุ้มครองตามเอกสารแนบท้าย",
         "details": [
           {
             "detail": "อุบัติเหตุส่วนบุคคล (เสียชีวิต สูญเสียอวัยวะ ทุพพลภาพถาวร)",
             "protection": "ผู้ขับขี่และผู้โดยสารในรถประกัน 100,000 บาท / คน"
           },
           {
             "detail": "ค่ารักษาพยาบาล",
             "protection": "100,000 บาท / คน"
           },
           {
             "detail": "การประกันตัวผู้ขับขี่",
             "protection": "300,000 บาท / ครั้ง"
           },
           {
             "detail" : "จำนวนที่นั่ง",
             "protection" : "เก๋ง 7 / ปิคอัพ 4 / รถตู้ 4"
           }
         ]
        }
      ],
      "annotation" : [
        {
          "header" : "หมายเหตุ",
          "detail" : "คุ้มครองกรณีชนกับยานพาหนะทางบกเท่านั้น<br/>*คุ้มครองกรณีเป็นฝ่ายถูกและคู่กรณีไม่มีประกันภัย<br/>(1) สำหรับรถเก๋ง (110), รถปิคอัพขนาดไม่เกิน 3 ตัน (320) และรถตู้ส่วนบุคคล (210) เท่านั้น (2) คุ้มครองความเสียหายต่อรถยนต์ที่เอาประกันภัย เฉพาะกรณีที่เฉี่ยวชนกับยานพาหนะทางบกเท่านั้น (3) มูลค่ารถยนต์ขณะที่เอาประกันภัย ต้องไม่ต่ำกว่าจำนวนเงินเอาประกันภัยตามแผนประกันภัยที่เลือก (4) ไม่รับประกันรถที่ติดตั้งโครง-หลังคาเหล็ก โหลดเตี้ย รถแข่งหรือรถดัดแปลงสภาพทุกชนิด (5) คุ้มครองอุปกรณ์เครื่องตกแต่งตามมาตรฐานของโรงงานเท่านั้น"
        },
      ]
    })
    await protectionDetail.save()
  }
}

module.exports = ProtectionDetailSeeder
