'use strict'

/*
|--------------------------------------------------------------------------
| ProtectionDetailSeeder
|--------------------------------------------------------------------------
|
| Make use of the Factory instance to seed database with dummy data or
| make use of Lucid models directly.
|
*/

/** @type {import('@adonisjs/lucid/src/Factory')} */
const ProtectionDetail = use('App/Models/ProtectionDetail')

class ProtectionDetailSeeder {
  async run () {
    var protectionDetail
    // protectionDetail.detail = JSON.stringify({
    //   "...": "...",
    //   "...": "...",
    // })

    protectionDetail = new ProtectionDetail()
    protectionDetail.details = JSON.stringify({
      "protections": [
        {
         "header": "ความรับผิดต่อกลุ่มบุคคลภายนอก",
         "details": [
           {
             "detail": "ความเสียหายต่อชีวิต ร่างกายหรืออนามัยเฉพาะส่วนที่เกิน (วงเงินสูงสุดตาม พรบ. = 10,000,000 บาท / ครั้ง)",
             "protection": "500,000 บาท / คน"
           },
           {
             "detail": "ความเสียหายต่อทรัพย์สิน",
             "protection": "1,000,000 บาท / ครั้ง"
           },
         ]
        },
        {
         "header": "รถยนต์เสียหาย สูญหาย ไฟไหม้",
         "details": [
           {
             "detail": "ความเสียหายต่อรถยนต์",
             "protection": "ไม่เกินทุนประกัน"
           },
           {
             "detail": "รถยนต์สูญหาย/ไฟไหม้",
             "protection": "ไม่เกินทุนประกัน"
           },
         ]
        },
        {
         "header": "ความคุ้มครองตามเอกสารแนบท้าย",
         "details": [
           {
             "detail": "อุบัติเหตุส่วนบุคคล (เสียชีวิต สูญเสียอวัยวะ ทุพพลภาพถาวร)",
             "protection": "ผู้ขับขี่และผู้โดยสารในรถประกัน 100,000 บาท / คน"
           },
           {
             "detail": "ค่ารักษาพยาบาล",
             "protection": "100,000 บาท / คน"
           },
           {
             "detail": "การประกันตัวผู้ขับขี่",
             "protection": "300,000 บาท / ครั้ง"
           },
           {
             "detail" : "จำนวนที่นั่ง",
             "protection" : "รถเก๋ง 7 / รถปิคอัพ 4 / รถตู้4"
           }
         ]
        }
      ],
      "annotation" : [
        {
          "header" : "เงื่อนไขการรับประกันภัย",
          "detail" : "(1) สำหรับรถญี่ปุ่นและอื่นๆ (รถกลุ่ม 3-5) เช่น Honda Accord, Toyota Altis, Nissan March, Toyota Commuter เป็นต้น (2) สำหรับรถยุโรป (กลุ่ม 1-2) เช่น Mercedes Benz, BMW, VOLVO, AUDI เป็นต้น (3) รถยนต์นั่งใช้ส่วนบุคคล (รหัส 110), รถกระบะปิคอัพไม่เกิน 3 ตัน (รหัส 320), รถตู้โดยสารส่วนบุคคล (รหัส 210) (4) เบี้ยประกันภัยข้างต้นยังไม่รวมเบี้ยประกันภัย พรบ. (ภาคบังคับ) : เก๋ง = 645.21 บาท, กระบะปิคอัพ = 967.28 บาท, ตู้โดยสารส่วนบุคคล = 1,182.35 บาท (5) ไม่จำกัดอายุรถยนต์กรณีซ่อมอู่ทั่วไป (ขอสงวนสิทธิ์เฉพาะรถยนต์ที่บริษัทกำหนด) และไม่เกิน 5 ปี กรณีซ่อมห้าง / ไม่ต้องตรวจสภาพรถก่อนทำประกันภัย (6) มูลค่ารถขณะที่เอาประกันภัย ต้องไม่ต่ำกว่าจำนวนเงินเอาประกันภัยตามแผนประกันภัยที่เลือก และคุ้มครองอุปกรณ์เครื่องตกแต่ง ตามมาตรฐานของโรงงานเท่านั้น (7) เบี้ยประกันภัยข้างต้นได้คำนวณรวมส่วนลดกล้องโทรทัศน์วงจรปิด (CCTV) ไว้แล้ว และมีผลบังคับจนกว่าจะมีการแจ้งเปลี่ยนแปลง"
        },
        {
          "header" : "รถยนต์ที่บริษัทฯ สงวนสิทธิ์ ไม่รับประกันภัย",
          "detail" : "(1) รถยนต์รับจ้างหรือให้เช่า,รถยนต์ที่ใช้เพื่อการพาณิชย์ มูลนิธิ รถร่วม รถกู้ชีพ รถอาสากู้ภัย รถติดไซเรน ฯลฯ (2) ไม่รับประกันรถบรรทุกเชื้อเพลิง กรด แก๊ส หรือรถบรรทุกวัตถุอันตราย, รถยนต์ที่มีการตกแต่งเพิ่มเติม หรือดัดแปลงสภาพจากเดิม เช่น รถโหลดเตี้ยหรือยกสูง, รถปรับแต่งเครื่องยนต์ (3) ติดเคฟลาร์ (Cafla), สติ๊กเกอร์ตกแต่งทุกชนิด และหรือ รถกระบะที่มีการติดตั้งอุปกรณ์เสริมพิเศษต่างๆ เช่น ติดตั้งตู้เหล็กพร้อมเครื่องทำความเย็น, เครน, ตะแกรงเหล็ก, เฮี๊ยบ, โครงเหล็กหรือหลังคา หรืออุปกรณ์ใดๆ เช่น ติดตั้งตู้เหล็กพร้อมเครื่องทำความเย็น, เครน, ตะแกรงเหล็ก, เฮี๊ยบ, โครงเหล็กหรือหลังคา หรืออุปกรณ์ใดๆ"
        }
      ]
    })
    await protectionDetail.save()

  }
}

module.exports = ProtectionDetailSeeder
